// Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

// A (3,6,8); B (2,1,-7), -> 15.84

// A (7,-5, 0); B (1,-1,9) -> 11.53

using System;

namespace homework
{
    class Program
    {
        public static void Print(string word)
        {
            Console.WriteLine(word);
        }


        static void Main()
        {
            Print("По координатам двух точек найдите расстояние между ними в 3D пространстве");
            Print("Введите координаты точек");

        }
    }

}


